app/Http/Controllers/API/ImageTemplateController.php

    public function getTemplate($id){
        $response = DB::table('templates')
            ->whereRaw('pid = ?', [$id])->first();
---
select * from `templates` where pid = '1402' and size = 'XS' limit 1