app/Http/Controllers/API/ImageMakerController.php

    public function index(Request $request, $pid, $size, $art_design = 0, $mediaId = null)
    {

        $newWidth = 400;
        $newHeight = 400;
        $topX = 999;
        $topY = 999;
        $bottomX = 0;
        $bottomY = 0;

        $design = null;

            // Get design
            try {

                if($art_design != 0) {
                    $design_query = \App\ArtistDesigns::where('id', '=', $art_design);

                    $design = json_decode($design_query->first()->design_data);//\App\ArtistDesigns::where('id', '=', $art_design)->first()->design_data);
                } else {
                    $design = new \stdClass();
                    $design->objects = [];
                }

                $template = \App\Templates::where('pid', '=', $pid)
                        ->where('size', '=', $size);

                if($template->exists()){
                    $template = (object)array_filter((array)json_decode($template->first()->values));
---
select * from `templates` where `pid` = '112' and `size` = 'XS' limit 1
select exists(select * from `templates` where `pid` = '112' and `size` = 'XS') as `exists`