app/Http/Controllers/AddProductsController.php

    public function addProducts(Request $request)
    {
        $user_id = Auth::user()->getAuthIdentifier();

        // TODO: Add settings to contorl the actual item images to be shown
        $pidList = [
            "shirt" => 112,
            "hoodie" => 111,
            "hat" => 1402,
            "bag" => 333,
            "pillow" => 1456,
            "canvas" => 1455,
            //"cup" => 000
        ];

        $items = [];

        foreach($pidList as $type => $pid){
            $items[$type] = [$pid, ProductInformation::mediaById($pid)[0]->url];
        }

        $artworks = Artwork::where('parentid', '=', $user_id)->get();

        foreach($artworks as $k => $artwork){
            $artworks[$k]->url = \App\Media::getUrlById($artwork->mediaid);
        }

        // Get Storefront IDS
        $storefronts = Storefront::select("id","name")->where('user_id', '=', $user_id)->get();
---
select * from `tbl_art_work` where `parentid` = 44
select `id`, `name` from `tbl_store_front` where `user_id` = 44