app/Http/Controllers/DashboardController.php

select * from `users` where `id` = 44 limit 1
---
    public function myAccount(Request $request) {

        if($request->isMethod('POST')){
            if(!$this->updateAccount($request)) {
                session()->flash('error', 'There was an error updating your account details.');
            }
        }

        $user_id = Auth::user()->id;
        $result = DB::table('users')
            ->where('id', '=', $user_id)->first();