app/Http/Controllers/ManageDesignsController.php

select `id`, `name` from `tbl_store_front` where `user_id` = 44
---
    public function index(Request $request){

        $user_id = (Auth::check()) ? Auth::user()->getAuthIdentifier() : null;

        $sort = ($request->has("sort")) ? $request->input("sort") : null;

       if($sort !== null || is_numeric($sort)){
           $designs = ArtistDesigns::where("artist_id", "=", $user_id)
               ->whereRaw("FIND_IN_SET('?',storefronts)",[$sort])
               ->get();
       } else {
           $designs = ArtistDesigns::where("artist_id", "=", $user_id)->get();
       }


        // Get Storefront IDS
        $storefronts = Storefront::select("id","name")->where('user_id', '=', $user_id)->get();