app/Http/Controllers/MockupgenController.php

    public function index(Request $request, $pid, $did = null)
    {

        $art_id = ($request->has('art_id')) ? $request->input('art_id') : array(0);

        $product = DB::table('tbl_products')
            ->select('image')
            ->where('id', '=', $pid)
            ->get();

        $images = DB::table('tbl_media_library')
            ->select("full_url","thumbnail")
            ->whereIn("id", explode(",", $product[0]->image) )
            ->get();
---
select `image` from `tbl_products` where `id` = '1455'
select `full_url`, `thumbnail` from `tbl_media_library` where `id` in ('1315488')

            })
            ->get();

        $attributes = DB::table('tbl_attribute_detail')
            ->select(DB::raw("tbl_attribute_detail.attribute_id, tbl_attribute_detail.value, tbl_attribute_detail.code1,
                    tbl_attribute_detail.code2, tbl_attribute_detail.imageId, tbl_attribute_m.label as attribute_label, tbl_media_library.full_url as img_url"))
            ->leftJoin('tbl_attribute_m', function($join){
                $join->on(DB::raw("tbl_attribute_m.id"),"=",DB::raw("tbl_attribute_detail.attribute_id"));
            })
            ->leftJoin('tbl_media_library', function($join){
                $join->on(DB::raw("tbl_media_library.id"), "=", DB::raw("tbl_attribute_detail.imageId"));
            })
            ->where("productId","=",$pid)
            ->get();

        $variants = DB::table('tbl_product_variants')
            ->where('ProductId', '=', $pid)
            ->get();
---
select tbl_attribute_detail.attribute_id, tbl_attribute_detail.value, tbl_attribute_detail.code1,
tbl_attribute_detail.code2, tbl_attribute_detail.imageId, tbl_attribute_m.label as attribute_label, tbl_media_library.full_url as img_url from `tbl_attribute_detail` left join `tbl_attribute_m` on tbl_attribute_m.id = tbl_attribute_detail.attribute_id left join `tbl_media_library` on tbl_media_library.id = tbl_attribute_detail.imageId where `productId` = '1455'
select * from `tbl_product_variants` where `ProductId` = '1455'

        $storefronts = null;

        if(Auth::check()){
            $storefronts = Storefront::where("user_id", "=", $user_id)->get();
---
select * from `tbl_store_front` where `user_id` = 44