app/Http/Controllers/MyStoresController.php

    public function addArtWork(Request $request, $id = null)
    {
        $user_id = Auth::user()->id;
        $data = array("privateKey" => "password");
        $data_string = json_encode($data);

        $categories = \App\ArtCategory::select(['id','name'])
                    ->where('type', '=', 'templates')
                    ->where('active', '=', 1)
                    ->get();

        $artworks = \App\Artwork::where("parentid", "=", $user_id)->orderBy('id', 'desc')
            ->get();
---
select `id`, `name` from `tbl_art_category` where `type` = 'templates' and `active` = 1
select * from `tbl_art_work` where `parentid` = 44 order by `id` desc